// src/data/mockData.js

export const lecturersData = [
  {
    id: 1,
    photoUrl: "https://i.ibb.co/kVF0jFLd/prepod2.jpg", 
    name: "Иванова Мария Сергеевна",
    role: "Эксперт по IT-архитектуре",
    rating: "4.9",
    experience: "10 лет",
    description: "Более 10 лет опыта в разработке высоконагруженных систем. Проводит лекции по проектированию баз данных и микросервисов.",
    extraBlock: "Стоимость лекции: от 15 000 руб. / Формат: онлайн.",
    tags: ["IT", "Архитектура", "Базы данных"]
  },
  {
    id: 2,
    photoUrl: "https://i.ibb.co/7d3cS8Hm/prepod1.jpg",
    name: "Петров Алексей Владимирович",
    role: "Бизнес-тренер",
    rating: "4.8",
    experience: "7 лет",
    description: "Специализируется на управлении проектами и Agile-методологиях. Помогает компаниям выстраивать эффективные процессы.",
    extraBlock: "Ближайшая лекция: 25 октября. Тема: 'Scrum на практике'.",
    tags: ["Менеджмент", "Agile", "Scrum"]
  }
];

export const partnersData = [
  {
    id: 1,
    name: "ICL",
    description: "ICL — высокотехнологичная, динамично развивающаяся группа компаний, входящая в число крупнейших ИТ-компаний России, предоставляющая весь спектр ИТ-услуг, проектов, решений и продуктов. Компания была основана в 1991 году на базе завода ЭВМ Казанским производственным объединением вычислительных систем (КПО ВС).",
    logo: "https://i.ibb.co/B5JPGh5V/icl.jpg",
    websiteUrl: "https://icl.ru/" 
  },
  {
    id: 2,
    name: "TATNEFT",
    description: "«Татнефть» - одна из крупнейших российских вертикально-интегрированных компаний, в составе которой динамично развиваются нефтегазодобыча, нефтепереработка, нефтехимия, сеть АЗС, композитный кластер, электроэнергетика, разработка и производство оборудования для нефтегазовой отрасли и блок сервисных структур.",
    logo: "https://i.ibb.co/kgy1bKWS/tat.jpg",
    websiteUrl: "https://www.tatneft.ru/" 
  }
];